cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргФормыУправленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФормыУправленияМКД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФормыУправленияМКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетОбъемовВыполняетУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначениеПлощадейМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначениеПлощадейМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидБлагоустройствАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидБлагоустройствАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияПлощадей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоКомнат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПроживающих</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСДанными/Ext/Module.bsl
#Область ОбработчикиСобытий

Функция ПолучитьТарифыАбонента(пАбонент) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИспользованиеУслуг.Тариф КАК Тариф
	                     // |	ИспользованиеУслуг.ТО КАК ТочкаОтпуска
	                      |ИЗ
	                      |	РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	                      |ГДЕ
	                      |	ИспользованиеУслуг.Абонент = &Абонент
	                      |	И ИспользованиеУслуг.Тариф.ВидУслуги.Выводить = ИСТИНА");
	
	Запрос.УстановитьПараметр("Абонент",пАбонент);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
	
КонецФункции

Функция ПолучитьУслугиАбонента(пАбонент, Период) Экспорт
	// Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ.
	//                      |	ВложенныйЗапрос.Поставщик КАК Поставщик,
	//                      |	ВложенныйЗапрос.Услуга КАК Услуга,
	//                      |	СостояниеУслуг.Состояние КАК Состояние,
	//                      |	ВложенныйЗапрос.Вывод КАК Вывод.
	//                      |ИЗ
	//                      |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |		ИспользованиеУслуг.Тариф.ВидУслуги КАК Услуга,
	//                      |		ИспользованиеУслуг.Тариф.Поставщик КАК Поставщик,
	//                      |		ИспользованиеУслуг.Тариф.ВидУслуги.Выводить КАК Вывод,
	//                      |		ИспользованиеУслуг.Тариф КАК Тариф.
	//                      |	ИЗ
	//                      |		РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	//                      |	ГДЕ
	//                      |		ИспользованиеУслуг.Абонент = &Абонент
	//                      |	
	//                      |	ОБЪЕДИНИТЬ ВСЕ
	//                      |	
	//                      |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |		ВзаиморасчетыНовыйОбороты.Услуга,
	//                      |		ВзаиморасчетыНовыйОбороты.Поставщик,
	//                      |		ВзаиморасчетыНовыйОбороты.Услуга.Выводить,
	//                      |		NULL
	//                      |	ИЗ
	//                      |		РегистрНакопления.ВзаиморасчетыНовый.Обороты(
	//                      |			,
	//                      |			,
	//                      |			,
	//                      |			Абонент = &Абонент) КАК ВзаиморасчетыНовыйОбороты) КАК ВложенныйЗапрос
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |			ИспользованиеУслугСрезПоследних.Состояние КАК Состояние,
	//                      |			ИспользованиеУслугСрезПоследних.Тариф.Поставщик КАК Поставщик,
	//                      |			ИспользованиеУслугСрезПоследних.Тариф.ВидУслуги КАК ТарифВидУслуги.
	//                      |		ИЗ
	//                      |			РегистрСведений.ИспользованиеУслуг.СрезПоследних(&Дата,
											// Абонент = &Абонент) КАК ИспользованиеУслугСрезПоследних) КАК СостояниеУслуг.
	//                      |		ПО ВложенныйЗапрос.Поставщик = СостояниеУслуг.Поставщик.
	//                      |			И ВложенныйЗапрос.Услуга = СостояниеУслуг.ТарифВидУслуги.
	//                      |ГДЕ
	//                      |	ВложенныйЗапрос.Тариф <> &Пустой
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	ВложенныйЗапрос.Поставщик.Наименование
	//                      |ИТОГИ
	//                      |	МИНИМУМ(Состояние),
	//                      |	МИНИМУМ(Вывод)
	//                      |ПО
	//                      |	Поставщик,
	//                      |	Услуга");
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВложенныйЗапрос.Услуга КАК Услуга,
	                      |	ВложенныйЗапрос.Вывод КАК Вывод
	                      |ИЗ
	                      |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		ИспользованиеУслуг.Услуга КАК Услуга,
	                      |		ИспользованиеУслуг.Услуга.УдалитьВыводить КАК Вывод
	                      |	ИЗ
	                      |		РегистрСведений.энргИспользованиеУслуг КАК ИспользованиеУслуг
	                      |	ГДЕ
	                      |		ИспользованиеУслуг.Абонент = &Абонент
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		ВзаиморасчетыНовыйОбороты.Услуга,
	                      |		ВзаиморасчетыНовыйОбороты.Услуга.УдалитьВыводить
	                      |	ИЗ
	                      |		РегистрНакопления.энргВзаиморасчеты.Обороты(, , , Абонент = &Абонент) КАК ВзаиморасчетыНовыйОбороты) КАК ВложенныйЗапрос
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |			ИспользованиеУслугСрезПоследних.Услуга КАК ВидУслуги
	                      |		ИЗ
	                      |			РегистрСведений.энргИспользованиеУслуг.СрезПоследних(&Дата, Абонент = &Абонент) КАК ИспользованиеУслугСрезПоследних) КАК СостояниеУслуг
	                      |		ПО ВложенныйЗапрос.Услуга = СостояниеУслуг.ВидУслуги
	                      |ИТОГИ
	                      |	МИНИМУМ(Вывод)
	                      |ПО
	                      |	Услуга");
	

	Запрос.УстановитьПараметр("Абонент",пАбонент); 	
	// Запрос.УстановитьПараметр("Пустой",Справочники.Тарифы.ПустаяСсылка());     ???
	// Запрос.УстановитьПараметр("Сальдо",Перечисления.ВидыОпераций.НачальноеСальдо);  ???
	Запрос.УстановитьПараметр("Дата", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаЗапроса;
	
КонецФункции

Функция ПолучитьУслугиАбонентаСТарифом(пАбонент) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВложенныйЗапрос.Услуга,
	                      |	ВложенныйЗапрос.Поставщик,
	                      |	ВложенныйЗапрос.Вывод,
	                      |	ВложенныйЗапрос.Тариф
	                      |ИЗ
	                      |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		ИспользованиеУслуг.Тариф.ВидУслуги КАК Услуга,
	                      |		ИспользованиеУслуг.Тариф.Поставщик КАК Поставщик,
	                      |		ИспользованиеУслуг.Тариф.ВидУслуги.Выводить КАК Вывод,
	                      |		ИспользованиеУслуг.Тариф КАК Тариф
	                      |	ИЗ
	                      |		РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	                      |	ГДЕ
	                      |		ИспользованиеУслуг.Абонент = &Абонент
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		ВзаиморасчетыНовыйОбороты.Услуга,
	                      |		ВзаиморасчетыНовыйОбороты.Поставщик,
	                      |		ВзаиморасчетыНовыйОбороты.Услуга.Выводить,
	                      |		NULL
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчетыНовый.Обороты(
	                      |			,
	                      |			,
	                      |			,
	                      |			Абонент = &Абонент
	                      |			    И ВидОперации = &Сальдо) КАК ВзаиморасчетыНовыйОбороты) КАК ВложенныйЗапрос
	                      |ГДЕ
	                      |	ВложенныйЗапрос.Тариф <> &Пустой");
      	
	Запрос.УстановитьПараметр("Абонент",пАбонент); 	
	Запрос.УстановитьПараметр("Пустой",Справочники.Тарифы.ПустаяСсылка());
	Запрос.УстановитьПараметр("Сальдо",Перечисления.ВидыОпераций.НачальноеСальдо);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
	
КонецФункции
 
Функция ПолучитьУслугиАбонентаСНачислением(пАбонент, нПериод, кПериод) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                      |	Услуги.Тариф,
                      |	Объем.СуммаНачислено КАК Начислено,
                      |	Объем.ОбъемУслугиОборот КАК Объем,
                      |	Услуги.Абонент,
                      |	Услуги.Поставщик,
                      |	Услуги.Тариф.ВидУслуги КАК Услуга
                      |ИЗ
                      |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
                      |		ИспользованиеУслуг.Тариф КАК Тариф,
                      |		ИспользованиеУслуг.Абонент КАК Абонент,
                      |		ИспользованиеУслуг.Тариф.Поставщик КАК Поставщик
                      |	ИЗ
                      |		РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
                      |	ГДЕ
                      |		ИспользованиеУслуг.Абонент В (&Абонент)) КАК Услуги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ОбъемНачисленийОбороты.Абонент КАК Абонент,                      
                      |			ОбъемНачисленийОбороты.Тариф КАК Тариф,
                      |			ВЫБОР
                      |				КОГДА ОбъемНачисленийОбороты.ВидОперации = &Начисление
					  |					ТОГДА ОбъемНачисленийОбороты.СуммаОборот
					  //|					ТОГДА ОбъемНачисленийОбороты.СуммаОборот - ОбъемНачисленийОбороты.СуммаЛьготОборот.
                      |				ИНАЧЕ 0
                      |			КОНЕЦ КАК СуммаНачислено,
                      |			ВЫБОР
                      |				КОГДА ОбъемНачисленийОбороты.ВидОперации = &Начисление
                      |					ТОГДА ОбъемНачисленийОбороты.ОбъемУслугиОборот
                      |				ИНАЧЕ 0
                      |			КОНЕЦ КАК ОбъемУслугиОборот
                      |		ИЗ
                      |			РегистрНакопления.ОбъемНачислений.Обороты(&НачПериода, &КонПериода, , Абонент В (&Абонент)) КАК ОбъемНачисленийОбороты) КАК Объем
                      |		ПО Услуги.Тариф = Объем.Тариф
                      |			И Услуги.Абонент = Объем.Абонент
                      |			И Услуги.Поставщик = Объем.Тариф.Поставщик");
      	
	Запрос.УстановитьПараметр("Абонент", пАбонент);
	Запрос.УстановитьПараметр("НачПериода", нПериод); 
	Запрос.УстановитьПараметр("КонПериода", кПериод); 
	Запрос.УстановитьПараметр("Начисление", Перечисления.ВидыОпераций.Начисление);  	
			                     
	РезультатЗапроса 	= Запрос.Выполнить();
	ВыборкаЗапроса 		= РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
	
КонецФункции
  
Функция ПолучитьСписокАбонентов(ДанныеСтроки, Абонент, Точка, НачПер,КонПер) Экспорт
	Результат = "";
	РезультатОбъем = "";
	Если Не  Абонент.Пустая() Тогда
		Результат = " И ИспользованиеУслуг.Абонент В ИЕРАРХИИ(&Абонент) "
	КонецЕсли;
	
	Если Не Абонент.Пустая() Тогда
		РезультатОбъем = " И Абонент В ИЕРАРХИИ(&Абонент) ";
	КонецЕсли;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Услуги.Тариф,
	                      |	ЕСТЬNULL(Объем.СуммаНачислено, 0) КАК Сумма,
	                      |	ЕСТЬNULL(Объем.ОбъемУслугиОборот, 0) КАК Объем,
	                      |	Услуги.Абонент,
	                      |	Услуги.Поставщик,
	                      |	Услуги.Тариф.ВидУслуги КАК Услуга,
	                      |	Услуги.ТО
	                      |ИЗ
	                      |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		ИспользованиеУслуг.Тариф КАК Тариф,
	                      |		ИспользованиеУслуг.Абонент КАК Абонент,
	                      |		ИспользованиеУслуг.Тариф.Поставщик КАК Поставщик,
	                      |		ИспользованиеУслуг.ТО КАК ТО
	                      |	ИЗ
	                      |		РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	                      |	ГДЕ
	                      |		ИспользованиеУслуг.ТО = &ТО И ИспользованиеУслуг.Тариф = &Тариф" + Результат + ") КАК Услуги
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ОбъемНачисленийОбороты.Абонент КАК Абонент,
	                      |			ОбъемНачисленийОбороты.Тариф.ВидУслуги КАК Услуга,
	                      |			ОбъемНачисленийОбороты.Тариф КАК Тариф,
	                      |			ВЫБОР
	                      |				КОГДА ОбъемНачисленийОбороты.ВидОперации = &Начисление
	                      |					ТОГДА ОбъемНачисленийОбороты.СуммаОборот - ОбъемНачисленийОбороты.СуммаЛьготОборот
	                      |				ИНАЧЕ 0
	                      |			КОНЕЦ КАК СуммаНачислено,
	                      |			ВЫБОР
	                      |				КОГДА ОбъемНачисленийОбороты.ВидОперации = &Начисление
	                      |					ТОГДА ОбъемНачисленийОбороты.ОбъемУслугиОборот
	                      |				ИНАЧЕ 0
	                      |			КОНЕЦ КАК ОбъемУслугиОборот
	                      |		ИЗ
	                      |			РегистрНакопления.ОбъемНачислений.Обороты(&НачПериода, &КонПериода, , Тариф = &Тариф" + РезультатОбъем + ") КАК ОбъемНачисленийОбороты) КАК Объем
	                      |		ПО Услуги.Тариф = Объем.Тариф
	                      |			И Услуги.Абонент = Объем.Абонент
	                      |			И Услуги.Поставщик = Объем.Тариф.Поставщик");

	
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(НачПер));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПер));						  
 	Запрос.УстановитьПараметр("ТО", Точка);	
	Запрос.УстановитьПараметр("Тариф", ДанныеСтроки.Тариф);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Начисление", Перечисления.ВидыОпераций.Начисление); 
			
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
	
КонецФункции
 
Функция ПолучитьСписокАбонентовГруппа(ДанныеСтроки, Абонент, НачПер, КонПер) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъемНачисленийОбороты.Абонент,
	                      |	ВЫБОР
	                      |		КОГДА ОбъемНачисленийОбороты.ВидОперации = &Начисление
	                      |			ТОГДА ОбъемНачисленийОбороты.СуммаОборот - ОбъемНачисленийОбороты.СуммаЛьготОборот
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ОбъемНачисленийОбороты.ВидОперации = &Начисление
	                      |			ТОГДА ОбъемНачисленийОбороты.ОбъемУслугиОборот
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК Объем,
	                      |	ОбъемНачисленийОбороты.Тариф.ВидУслуги КАК Услуга,
	                      |	ОбъемНачисленийОбороты.ПриборУчета,
	                      |	ОбъемНачисленийОбороты.Тариф.Поставщик КАК Поставщик,
	                      |	ОбъемНачисленийОбороты.ТочкаОтпуска
	                      |ИЗ
	                      |	РегистрНакопления.ОбъемНачислений.Обороты(
	                      |		&НачПериода,
	                      |		&КонПериода,
	                      |		,
	                      |		Абонент В ИЕРАРХИИ (&Абонент)
	                      |		    И Тариф = &Тариф) КАК ОбъемНачисленийОбороты"); 
	
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(НачПер));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПер));	
	Запрос.УстановитьПараметр("Абонент",Абонент);
	Запрос.УстановитьПараметр("Тариф",ДанныеСтроки.Тариф);	
	Запрос.УстановитьПараметр("Начисление", Перечисления.ВидыОпераций.Начисление); 
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
	
КонецФункции
 
Функция ПолучитьУслугиПоТочке(ТочкаОтпуска) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИспользованиеУслуг.Тариф.ВидУслуги КАК Услуга,
	                      |	ИспользованиеУслуг.Тариф.Поставщик,
	                      |	ИспользованиеУслуг.Тариф
	                      |ИЗ
	                      |	РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	                      |ГДЕ
	                      |	ИспользованиеУслуг.ТО = &Точка");

	Запрос.УстановитьПараметр("Точка",ТочкаОтпуска);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
КонецФункции

Функция ПолучитьУслугиПоГруппеАбонентов(Абонент) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИспользованиеУслуг.Тариф.ВидУслуги КАК Услуга,
	                      |	ИспользованиеУслуг.Тариф.Поставщик КАК Поставщик,
	                      |	ИспользованиеУслуг.Тариф КАК Тариф
	                      |ИЗ
	                      |	РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	                      |ГДЕ
	                      |	ИспользованиеУслуг.Абонент В ИЕРАРХИИ(&Абонент)");
       	
	Запрос.УстановитьПараметр("Абонент",Абонент);	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
КонецФункции

Функция ПолучитьЛьготыАбонента(пАбонент) Экспорт
	
	Запрос = Новый Запрос("
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Жилец,
	|		Льгота
	| 	ИЗ 
	|		РегистрСведений.ИспользованиеЛьгот 
	|	ГДЕ 
	| 		Жилец.Владелец = &Абонент
	|	");
	
	Запрос.УстановитьПараметр("Абонент",пАбонент);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапроса;
	
КонецФункции

Функция ПолучитьКоличествоПрописанных(пАбонент, Период) Экспорт
	Если пАбонент.Пустая() ИЛИ пАбонент.ЭтоГруппа Тогда
		Возврат "";	
	КонецЕсли;  	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КоличествоПрописанныхСрезПоследних.Количество КАК Количество
	                    |ИЗ
	                    |	РегистрСведений.КоличествоПрописанных.СрезПоследних(&Период, Абонент = &Абонент) КАК КоличествоПрописанныхСрезПоследних");
						
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Абонент", пАбонент);
	ТЗ=Запрос.Выполнить().Выбрать();	
	ТЗ.Следующий();
	Количество = ТЗ.Количество;
	Возврат Количество;
	
КонецФункции

// Формирует строку с адресом
Функция ПолучитьАдресАбонента(пАбонент) Экспорт
	
	Если пАбонент.Пустая() ИЛИ пАбонент.ЭтоГруппа Тогда
		Возврат "";	
	КонецЕсли;
	СтруктураОтбора = Новый Структура("Объект");
	СтруктураОтбора.Вставить("Объект", пАбонент.Ссылка); 
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	КонтактнаяИнформация.Представление
	                       |ИЗ
	                       |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                       |ГДЕ
	                       |	КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Объект",пАбонент);
	ТЗ = Запрос.Выполнить().Выбрать();
	ТЗ.Следующий();
	Адрес = ТЗ.Представление;
	Возврат Адрес;
	
КонецФункции

Функция РубКоп(Сумма) Экспорт
	
	Руб = Цел(Сумма);
	Коп = ОКР(100*(Сумма-Руб),0,1);
	СуммаРубКоп = ""+Руб+" руб. "+Цел(Коп/10)+(Коп-10*Цел(Коп/10))+" коп.";
	
	Возврат СуммаРубКоп;
	
КонецФункции

Функция ПолучитьДополнительныеНачисления(Абонент, Период) Экспорт
	// Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |	ЕСТЬNULL(Услуги.Поставщик, Начисления.Поставщик) КАК Поставщик,
	//                      |	ЕСТЬNULL(Услуги.Услуга, Начисления.Услуга) КАК Услуга,
	//					  //|	Начисления.ВидНачисления,
	//                      |	Начисления.СуммаНачальныйОстаток КАК НачСальдо,
	//                      |	Начисления.СуммаПриход КАК Начислено,
	//                      |	Начисления.СуммаРасход КАК Оплачено,
	//                      |	Начисления.СуммаКонечныйОстаток КАК КонСальдо.
	//                      |ИЗ
	//                      |	(ВЫБРАТЬ
	//                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Абонент КАК Абонент,
	//                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Поставщик КАК Поставщик,
	//                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Услуга КАК Услуга,
	//                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.
											// СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	//                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.
											//	СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	//                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаОборот) КАК СуммаОборот,
	//                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	//                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаРасход) КАК СуммаРасход.
	//                      |	ИЗ
	//                      |		РегистрНакопления.ВзаиморасчетыПоДополнительнымНачислениям.ОстаткиИОбороты(&НачПериода,
									// &КонПериода, , , Абонент = &Абонент) КАК ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.
	//                      |	
	//                      |	СГРУППИРОВАТЬ ПО
	//                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Поставщик,
	//                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Абонент,
	//                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Услуга) КАК Начисления.
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |			ИспользованиеУслуг.Тариф.ВидУслуги КАК Услуга,
	//                      |			ИспользованиеУслуг.Тариф.Поставщик КАК Поставщик,
	//                      |			ИспользованиеУслуг.Тариф.ВидУслуги.Выводить КАК Вывод,
	//                      |			ИспользованиеУслуг.Тариф КАК Тариф,
	//                      |			ИспользованиеУслуг.Абонент КАК Абонент.
	//                      |		ИЗ
	//                      |			РегистрСведений.ИспользованиеУслуг КАК ИспользованиеУслуг
	//                      |		ГДЕ
	//                      |			ИспользованиеУслуг.Абонент = &Абонент
	//                      |		
	//                      |		ОБЪЕДИНИТЬ ВСЕ
	//                      |		
	//                      |		ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |			ВзаиморасчетыНовыйОбороты.Услуга,
	//                      |			ВзаиморасчетыНовыйОбороты.Поставщик,
	//                      |			ВзаиморасчетыНовыйОбороты.Услуга.Выводить,
	//                      |			NULL,
	//                      |			NULL
	//                      |		ИЗ
	//                      |			РегистрНакопления.ВзаиморасчетыНовый.Обороты(
	//                      |				,
	//                      |				,
	//                      |				,
	//                      |				Абонент = &Абонент) КАК ВзаиморасчетыНовыйОбороты) КАК Услуги.
	//                      |		ПО Услуги.Услуга = Начисления.Услуга.
	//                      |			И Услуги.Поставщик = Начисления.Поставщик
	//                      |			И Услуги.Абонент = Начисления.Абонент
	//                      |ГДЕ
	//                      |	Услуги.Тариф <> &Пустой");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЕСТЬNULL(Услуги.Услуга, Начисления.Услуга) КАК Услуга,
	                      |	Начисления.СуммаНачальныйОстаток КАК НачСальдо,
	                      |	Начисления.СуммаПриход КАК Начислено,
	                      |	Начисления.СуммаРасход КАК Оплачено,
	                      |	Начисления.СуммаКонечныйОстаток КАК КонСальдо
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Абонент КАК Абонент,
	                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Поставщик КАК Поставщик,
	                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Услуга КАК Услуга,
	                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаОборот) КАК СуммаОборот,
	                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	                      |		СУММА(ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
	                      |	ИЗ
	                      |		РегистрНакопления.энргВзаиморасчетыПоДополнительнымНачислениям.ОстаткиИОбороты(&НачПериода, &КонПериода, , , Абонент = &Абонент) КАК ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Поставщик,
	                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Абонент,
	                      |		ВзаиморасчетыПоДополнительнымНачислениямОстаткиИОбороты.Услуга) КАК Начисления
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |			ИспользованиеУслуг.Услуга КАК Услуга,
	                      |			ИспользованиеУслуг.Услуга.УдалитьВыводить КАК Вывод,
	                      |			ИспользованиеУслуг.Абонент КАК Абонент
	                      |		ИЗ
	                      |			РегистрСведений.энргИспользованиеУслуг КАК ИспользованиеУслуг
	                      |		ГДЕ
	                      |			ИспользованиеУслуг.Абонент = &Абонент
	                      |		
	                      |		ОБЪЕДИНИТЬ ВСЕ
	                      |		
	                      |		ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |			ВзаиморасчетыНовыйОбороты.Услуга,
	                      |			ВзаиморасчетыНовыйОбороты.Услуга.УдалитьВыводить,
	                      |			NULL
	                      |		ИЗ
	                      |			РегистрНакопления.энргВзаиморасчеты.Обороты(, , , Абонент = &Абонент) КАК ВзаиморасчетыНовыйОбороты) КАК Услуги
	                      |		ПО (Услуги.Услуга = Начисления.Услуга)
	                      |			И (Услуги.Абонент = Начисления.Абонент)");
	
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Период));
//	Запрос.УстановитьПараметр("Сальдо", Перечисления.ВидыОпераций.НачальноеСальдо);     ??
	Запрос.УстановитьПараметр("Абонент", Абонент);
// Запрос.УстановитьПараметр("Пустой", Справочники.Тарифы.ПустаяСсылка()); ???

	
	Возврат Запрос.Выполнить().Выбрать();
	
	
КонецФункции

Функция ПолучитьОбъектыРасчетаУправляющейКомпании(Период, Организация, Район, УК, Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД
		|ПОМЕСТИТЬ ВТ_МКД
		|ИЗ
		|	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район) КАК энргФормыУправленияМКДСрезПоследних
		|ГДЕ
		|	энргФормыУправленияМКДСрезПоследних.УК = &УК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСостояниеМКДСрезПоследних.МКД КАК МКД,
		|	энргСостояниеМКДСрезПоследних.МКД.ГруппаПотребителейПоУмолчанию КАК ГруппаПотребителейПоУмолчанию,
		|	СУММА(энргЗначениеПлощадейМКДСрезПоследних.Площадь) КАК Площадь
		|ИЗ
		|	РегистрСведений.энргСостояниеМКД.СрезПоследних(
		|			&Период,
		|			Район = &Район
		|				И Организация = &Организация
		|				И МКД В
		|					(ВЫБРАТЬ
		|						ВТ_МКД.МКД КАК МКД
		|					ИЗ
		|						ВТ_МКД КАК ВТ_МКД)) КАК энргСостояниеМКДСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
		|				&Период,
		|				Район = &Район
		|					И Организация = &Организация
		|					И МКД В
		|						(ВЫБРАТЬ
		|							ВТ_МКД.МКД КАК МКД
		|						ИЗ
		|							ВТ_МКД КАК ВТ_МКД)
		|					И ВидПлощади = &ВидПлощади) КАК энргЗначениеПлощадейМКДСрезПоследних
		|		ПО энргСостояниеМКДСрезПоследних.МКД = энргЗначениеПлощадейМКДСрезПоследних.МКД
		|ГДЕ
		|	энргСостояниеМКДСрезПоследних.Состояние
		|
		|СГРУППИРОВАТЬ ПО
		|	энргСостояниеМКДСрезПоследних.МКД,
		|	энргСостояниеМКДСрезПоследних.МКД.ГруппаПотребителейПоУмолчанию";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("УК", УК);
	Запрос.УстановитьПараметр("ВидПлощади", Перечисления.энргВидыПлощадей.ОбщаяПлощадьМКД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
		
КонецФункции

#КонецОбласти


Процедура ЗаполнитьСхемуДанныхЛицевогоСчетаНаГраницуВремени(Схема, ПараметрыОтбора) Экспорт 
	
	#Область ВидБлагоустройства
	// ВТ - УслугиДействующихТочек
	РегистрыСведений.энргВидБлагоустройствАбонента.ВидБлагоустройстваДействующихТочек(Схема, ПараметрыОтбора, "ВидБлагоустройствАбонента");  
	#КонецОбласти
	
	#Область ЗначенияПлощадей
	РегистрыСведений.энргЗначенияПлощадей.ЗначенияПлощадейПомещений(Схема, ПараметрыОтбора, "ЗначенияПлощадейПомещений");
	#КонецОбласти
	
	#Область КоличествоКомнат
	РегистрыСведений.энргКоличествоКомнат.ТекстСрезПоследних(Схема, ПараметрыОтбора, "КоличествоКомнат");
	#КонецОбласти
	
	#Область КоличествоПроживающих
	РегистрыСведений.энргКоличествоПроживающих.КоличествоПроживающихПомещения(Схема, ПараметрыОтбора, "КоличествоПроживающихПомещения");
	#КонецОбласти
	
	#Область КоличествоПрописанных
	РегистрыСведений.энргКоличествоПрописанных.КоличествоПрописанныхПомещения(Схема, ПараметрыОтбора, "КоличествоПрописанныхПомещения");
	#КонецОбласти 	
	
	#Область КоличествоСобственников
	РегистрыСведений.энргКоличествоСобственников.КоличествоСобственниковПомещения(Схема, ПараметрыОтбора, "КоличествоСобственниковПомещения");
	#КонецОбласти	
	
	#Область КоличествоЭтажей
	// Дополнить схемой этажности
	#КонецОбласти
	
	#Область КоэффициентПУ
	РегистрыСведений.энргКоэффциентыПриборовУчета.КоэффциентыПриборовУчета(Схема, ПараметрыОтбора, "КоэффциентыПриборовУчета");
	#КонецОбласти
	
	#Область НаправлениеИспользованияТочекУчета
	// ВТ - ДействующиеТочки
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема, ПараметрыОтбора, "НаправлениеИспользованияДействующихТочек");
	#КонецОбласти
	
	#Область энргТехническаяВозможностьУстановкиПУ
	// ВТ - ДействующиеТочки
	РегистрыСведений.энргТехническаяВозможностьУстановкиПУ.ТехническаяВозможностьУстановкиПУТочекУчета(Схема, ПараметрыОтбора, "ТехническаяВозможностьУстановкиПУТочекУчета");
	#КонецОбласти
	
	#Область ГруппаПотребителей
	РегистрыСведений.энргГруппыПотребителейАбонентов.ГруппыПотребителейАбонентов(Схема, ПараметрыОтбора, "ГруппыПотребителейАбонентов");
	#КонецОбласти
	
	#Область СвойствоТехническаяТочкиУчета
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема, ПараметрыОтбора, "СвойствоТехническаяТочкиУчета"); 
	#КонецОбласти	 
	
	#Область Жильцы
	//РегистрыСведений.энргПроживаниеЖильцов.(Схема, ПараметрыОтбора, "СвойствоТехническаяТочкиУчета"); 
	#КонецОбласти 
	
	#Область ОтключатьВНеполивнойСезон
	РегистрыСведений.энргАбонентыОтключаемыеВНеполивнойСезон.АбонентыОтключаемыеВНеполивнойСезон(Схема, ПараметрыОтбора, "АбонентыОтключаемыеВНеполивнойСезон"); 
	#КонецОбласти 	
	
	#Область Потери
	РегистрыСведений.энргЗначенияПотерь.АктуальныеЗначенияПотерь(Схема, ПараметрыОтбора, "АктуальныеЗначенияПотерь"); 
	#КонецОбласти
	
	#Область ПоставщикиУслуг
	РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугАбонента(Схема, ПараметрыОтбора, "ПоставщикиУслугАбонента"); 
	#КонецОбласти
	
	#Область СпособРаспределенияОбъемаПомещения
	РегистрыСведений.энргСпособыРаспределенияОбъемаПомещения.АктуальныеСпособыРаспределенияОбъемаПомещения(Схема, ПараметрыОтбора, "АктуальныеСпособыРаспределенияОбъемаПомещения"); 
	#КонецОбласти
	
	#Область ТочкаУчетаРодитель
	РегистрыСведений.энргРодительТочкиУчета.АктуальныеРодителиТочекУчета(Схема, ПараметрыОтбора, "АктуальныеРодителиТочекУчета"); 
	#КонецОбласти
	
КонецПроцедуры
